pajacobs-ghub/AVR64EA28-DAQ-MCU-firmware/daq_mcu.c
// daq_mcu.c
// Use an AVR64EA28-I/SP as the DAQ-MCU in the two-processor DAQ node.
// Look at the notes in the USQ edaqs workbook pages 47 ff November 2023.
//
// PJ
// 2023-11-21 First cut adapted from the peripheral demo codes.
// 2023-11-21 Add the basic command interpreter and let it run the show.
// 2023-12-03 Make use of external memory for sample storage.
// 2023-12-03 EEPROM code for saving and restoring config register values.
// 2024-03-29 Less chatty mode for interfacing with PIC18 COMMS-MCU.
//            Changed to using new-line character at end of output messages.

// This version string will be reported by the version command.
#define VERSION_STR "v0.13 AVR64EA28 DAQ-MCU 2024-03-29"

#include "global_defs.h"
#include <xc.h>
#include <avr/cpufunc.h>
#include <util/delay.h>
#include "usart.h"
#include "timerA-free-run.h"
#include "spi_sram.h"
#include "eeprom.h"
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>

#pragma config PERIOD = PERIOD_OFF, WINDOW = WINDOW_OFF
#pragma config SLEEP = SLEEP_DISABLE, ACTIVE = ACTIVE_DISABLE, SAMPFREQ = SAMPFREQ_128HZ, LVL = LVL_BODLEVEL0
#pragma config EESAVE = EESAVE_DISABLE, RSTPINCFG = RSTPINCFG_RESET, UPDIPINCFG = UPDIPINCFG_UPDI, CRCSEL = CRCSEL_CRC16, CRCSRC = CRCSRC_NOCRC
#pragma config SUT = SUT_64MS

// String buffer for assembling text for output.
#define NSTRBUF 256
char str_buf[NSTRBUF];
char allow_multiline_response = 0;
// Text buffer for incoming commands.
// They are expected to be short.
// Be careful, overruns are not handled well.
#define NCMDBUF 64
char cmd_buf[NCMDBUF];

#define MAXNCHAN 12
int16_t res[MAXNCHAN];

// State of play is indicated by these flags.
uint32_t next_byte_addr_in_SRAM;
uint8_t busy_n;
uint8_t event_n;

static inline void assert_event_pin()
{
    // Actively pull the pin low.
    PORTF.OUTCLR = PIN1_bm;
    PORTF.DIRSET = PIN1_bm;
    event_n = 0;
}

static inline void release_event_pin()
{
    // Release drive on the pin.
    PORTF.DIRCLR = PIN1_bm;
    event_n = 1;
}

static inline uint8_t read_event_pin()
{
    return (PORTF.IN & PIN1_bm) ? 1 : 0;
}

static inline void assert_busy_pin()
{
    // Actively pull the pin low.
    PORTF.OUTCLR = PIN0_bm;
    PORTF.DIRSET = PIN0_bm;
    busy_n = 0;
}

static inline void release_busy_pin()
{
    // Release drive on the pin.
    PORTF.DIRCLR = PIN0_bm;
    busy_n = 1;
}

static inline void sampling_LED_ON()
{
    PORTA.OUTSET = PIN3_bm;
}

static inline void sampling_LED_OFF()
{
    PORTA.OUTCLR = PIN3_bm;
}

// Bit patterns for selecting analog-input pins.
const uint8_t muxpos_pin[] = {
    ADC_MUXPOS_AIN28_gc, // [0] = PC0  (actually decimal 28)
    ADC_MUXPOS_AIN29_gc, // [1] = PC1
    ADC_MUXPOS_AIN30_gc, // [2] = PC2
    ADC_MUXPOS_AIN31_gc, // [3] = PC3
    ADC_MUXPOS_AIN0_gc,  // [4] = PD0
    ADC_MUXPOS_AIN1_gc,  // [5] = PD1
    ADC_MUXPOS_AIN2_gc,  // [6] = PD2
    ADC_MUXPOS_AIN3_gc,  // [7] = PD3
    ADC_MUXPOS_AIN4_gc,  // [8] = PD4
    ADC_MUXPOS_AIN5_gc,  // [9] = PD5
    ADC_MUXPOS_AIN6_gc,  // [10] = PD6
    ADC_MUXPOS_AIN7_gc,  // [11] = PD7 (actually decimal 7)
    ADC_MUXPOS_GND_gc,   // [12] = GND (actually 0x30 decimal 48)
};
const uint8_t muxneg_pin[] = {
    ADC_MUXNEG_AIN28_gc, // [0] = PC0  (actually decimal 28)
    ADC_MUXNEG_AIN29_gc, // [1] = PC1
    ADC_MUXNEG_AIN30_gc, // [2] = PC2
    ADC_MUXNEG_AIN31_gc, // [3] = PC3
    ADC_MUXNEG_AIN0_gc,  // [4] = PD0
    ADC_MUXNEG_AIN1_gc,  // [5] = PD1
    ADC_MUXNEG_AIN2_gc,  // [6] = PD2
    ADC_MUXNEG_AIN3_gc,  // [7] = PD3
    ADC_MUXNEG_AIN4_gc,  // [8] = PD4
    ADC_MUXNEG_AIN5_gc,  // [9] = PD5
    ADC_MUXNEG_AIN6_gc,  // [10] = PD6
    ADC_MUXNEG_AIN7_gc,  // [11] = PD7 (actually decimal 7)
    ADC_MUXNEG_GND_gc,   // [12] = GND (actually 0x30)
};

// Parameters controlling the device are stored in virtual config registers.
#define NUMREG 34
int16_t vregister[NUMREG]; // working copy in SRAM

const char hint[NUMREG][12] = {
    "PER_TICKS", // 0
    "NCHANNELS", // 1
    "NSAMPLES",  // 2
    "TRIG_MODE", // 3
    "TRIG_CHAN", // 4
    "TRIG_LEVEL",// 5
    "TRIG_SLOPE", // 6
    "PGA_FLAG",  // 7
    "PGA_GAIN",  // 8
    "V_REF",     // 9
    "CH0+",      // 10
    "CH0-",      // 11
    "CH1+",      // 12
    "CH1-",      // 13
    "CH2+",      // 14
    "CH2-",      // 15
    "CH3+",      // 16
    "CH3-",      // 17
    "CH4+",      // 18
    "CH4-",      // 19
    "CH5+",      // 20
    "CH5-",      // 21
    "CH6+",      // 22
    "CH6-",      // 23
    "CH7+",      // 24
    "CH7-",      // 25
    "CH8+",      // 26
    "CH8-",      // 27
    "CH9+",      // 28
    "CH9-",      // 29
    "CH10+",     // 30
    "CH10-",     // 31
    "CH11+",     // 32
    "CH11-"      // 33
};

void set_registers_to_original_values()
{
    vregister[0] = 1250; // sample period in timer ticks
    vregister[1] = 6;    // number of channels to sample
    vregister[2] = 128;  // number of samples in record after trigger event
    vregister[3] = 0;    // trigger mode 0=immediate, 1=internal, 2=external
    vregister[4] = 0;    // trigger channel for internal trigger
    vregister[5] = 100;  // trigger level as an 11-bit count, 0-2048
    vregister[6] = 1;    // trigger slope 0=sample-below-level 1=sample-above-level
    vregister[7] = 0;    // PGA flag for all channels, 0=direct 1=via_PGA
    vregister[8] = 0;    // PGA gain 0=8X
    vregister[9] = 0;    // V_REF 0=1.024V
    // The first 6 channels (0 through 5) default to differential inputs,
    // spread across the full set of 12 analog pins.
    // This is expected to be the usual arrangement.
    vregister[10] = muxpos_pin[0];  // CH0+ = PC0 by default
    vregister[11] = muxneg_pin[1];  // CH0- = PC1 by default
    vregister[12] = muxpos_pin[2];  // CH1+ = PC2 by default
    vregister[13] = muxneg_pin[3];  // CH1- = PC3 by default
    vregister[14] = muxpos_pin[4];  // CH2+ = PD0 by default
    vregister[15] = muxneg_pin[5];  // CH2- = PD1 by default
    vregister[16] = muxpos_pin[6];  // CH3+ = PD2 by default
    vregister[17] = muxneg_pin[7];  // CH3- = PD3 by default
    vregister[18] = muxpos_pin[8];  // CH4+ = PD4 by default
    vregister[19] = muxneg_pin[9];  // CH4- = PD5 by default
    vregister[20] = muxpos_pin[10]; // CH5+ = PD6 by default
    vregister[21] = muxneg_pin[11]; // CH5- = PD7 by default
    // The second set of 6 channels default to single-ended inputs
    // across the later set of 6 analog pins.
    // If we happen to want to record 12 single-ended channels,
    // we need change only the selections for channels 0 through 5
    // because channels 6 through 100 are ready to be used.
    vregister[22] = muxpos_pin[6];  // CH6+ = PD2 by default
    vregister[23] = muxneg_pin[12]; // CH6- = GND by default
    vregister[24] = muxpos_pin[7];  // CH7+ = PD3 by default
    vregister[25] = muxneg_pin[12]; // CH7- = GND by default
    vregister[26] = muxpos_pin[8];  // CH8+ = PD4 by default
    vregister[27] = muxneg_pin[12]; // CH8- = GND by default
    vregister[28] = muxpos_pin[9];  // CH9+ = PD5 by default
    vregister[29] = muxneg_pin[12]; // CH9- = GND by default
    vregister[30] = muxpos_pin[10]; // CH10+ = PD6 by default
    vregister[31] = muxneg_pin[12]; // CH10- = GND by default
    vregister[32] = muxpos_pin[11]; // CH11+ = PD7 by default
    vregister[33] = muxneg_pin[12]; // CH11- = GND by default
}


